---
kind: method
id: M:Autodesk.Revit.DB.CurveUV.Dispose
source: html/0517da08-6208-a7ee-f78a-5e7bd7cb16e5.htm
---
# Autodesk.Revit.DB.CurveUV.Dispose Method

Releases all resources used by the CurveUV

## Syntax (C#)
```csharp
public void Dispose()
```